{
    "title": "Knowit Objectnet Fagseminar våren 2016",
    "event": {
        "date": "14.-15. oktober 2016",
        "longDate": "14. - 15. oktober 2016",
        "venue": "Quality Hotel Fredrikstad",
        "city": "Fredrikstad",
        "country": "Norge",
        "gmapsUrl": "https://www.google.com/maps/embed?pb=!1m18!1m12!1m3!1d2091299.1382406687!2d8.698165322408654!3d59.21126238152752!2m3!1f0!2f0!3f0!3m2!1i1024!2i768!4f13.1!3m3!1m2!1s0x46440327712c850d%3A0x242977c411e3527a!2sQuality+Hotel+Fredrikstad!5e0!3m2!1sno!2sno!4v1471247393134"
    },
    "schedules": [
      {
        "day": "Fredag 14. oktober",
        "collections": [
          {
              "time": "14:00-15:00 Fag",
              "entries": [
                {
                    "room": "Scala",
                    "slots": ["scala_kjoter", "feil_scala", "scala_script"]
                },
                {
                    "room": "Cloud",
                    "slots": ["knowit_cloud", "sky_ting", "dibk_sky"]
                },
                {
                    "room": "UX & Dev Coop",
                    "slots": ["ux_utvikler", "fuse", "designer_vs_utvikler"]
                },
                {
                    "room": "Kanban",
                    "slots": ["kanban_workshop"]
                }
              ]
          },
          {
              "time": "15:00-15:15 Pause",
              "isBreak": true
          },
          {
              "time": "15:15-16:15 Fag",
              "entries": [
                {
                    "room": "Code & Frameworks",
                    "slots": ["clean_code", "final_const", "spring_boot", "sjakkmotor"]
                },
                {
                    "room": "Tools",
                    "slots": ["jenkins_2", "beyond_compare", "git", "postman"]
                },
                {
                    "room": "Frontend",
                    "slots": ["storybook", "elm", "hololens"]
                },
                {
                    "room": "Kanban",
                    "slots": ["kanban_workshop"]
                }
              ]
          },
          {
              "time": "16:15-16:30 Pause",
              "isBreak": true
          },
          {
              "time": "16:30-18:00 Open Space (inkl. mat + øl)",
              "entries": [
                {
                    "room": "Rom 1",
                    "slots": ["openspace"]
                },
                {
                    "room": "Rom 2",
                    "slots": ["openspace"]
                },
                {
                    "room": "Rom 3",
                    "slots": ["openspace"]
                },
                {
                    "room": "Rom 4",
                    "slots": ["openspace"]
                }
              ]
          },
          {
              "time": "18:00-20:00 Fritid før middag",
              "isBreak": true
          }
        ]
      },
      {
        "day": "Lørdag 15. oktober",
        "collections": [
          {
              "time": "10:00-10:30 God morgen & fagstrategi",
              "entries": [
                {
                    "room": "Felles",
                    "slots": ["fagstrategi"]
                }
              ]
          },
          {
              "time": "10:30-10:45 Pause",
              "isBreak": true
          },
          {
              "time": "10:45-11:45 Foredrag",
              "entries": [
                {
                    "room": "Felles",
                    "slots": ["presentasjonsteknikk"]
                }
              ]
          },
          {
              "time": "12:00-13:00 Fag",
              "entries": [
                {
                    "room": "Arkitektur & metode",
                    "slots": ["arne", "event_source", "c4"]
                },
                {
                    "room": "Other Languages",
                    "slots": ["sql", "kotlin", "max"]
                },
                {
                    "room": "Soft skills",
                    "slots": ["prosjekt_faggruppe", "mlaas", "øltapping", "ruter_fagruppe"]
                }
              ]
          },
          {
              "time": "14:00 Buss hjem",
              "isBreak": true
          }
        ]
      }
    ],
    "talks": {
        "fagstrategi": {
            "pending": false,
            "speakers": [
              {
                "name": "Jan Henrik Gundelsby",
                "bio": "Jan Henrik er fagsjef i Knowit Objectnet. Han har 20 års erfaring med teknologi på JVMen. Har de siste årene syslet mye med applikasjonsdrift, mikrotjenester og DevOps sentralt i Oslo kommune. En ivrig lettvekts-fantast som forsøker å jobbe mot smidige arkitekturer og løsninger.",
                "pic": "jhg.jpg",
                "email": "jhg@knowit.no"
              },
                            {
                "name": "Haakon Spilde",
                "bio": "Haakon er fagsjef i Knowit Objectnet. Haakon er lidenskapelig opptatt av prosess og metode, med særlig fokus på Agile teknikker. Hvordan lære av sine feil, hvordan endre sine metoder og prosesser til det bedre og hvordan få et team til å fungere optimalt er tema som opptar Haakon.",
                "pic": "hfs.jpg",
                "email": "hfs@knowit.no"
              }

            ],
            "title": "Fagstrategi",
            "type": "Foredrag (30 min)",
            "description": "Hva er Knowit Objectnets fagstrategi? I denne halvtimen presenteres vårt \"Center Of Excellence systemutvikling\", neste års fagplan og hvilke faglige satsningsområder vi har fremover."
        },
        "final_const": {
            "pending": false,
            "speakers": [
              {
                "name": "Ole Bakstad",
                "bio": "Ole er en faglig engasjert utvikler som interesserer seg for alt fra programmering til utviklingsprosesser og organisasjonskultur. Spesielt interessert i hvordan tekniske valg påvirker måten man jobber på, jobbhverdagen til de ansatte og evnen til å skape verdi over tid. Aktiv medlem av JavaBin og JavaZone sin programkomité.",
                "pic": "ob.jpg",
                "email": "olebak@knowit.no"
              }
            ],
            "title": "Final? Gi meg const!",
            "type": "Lyntale (10 min)",
            "description": "Som tidligere C++-utvikler var jeg fornøyd da jeg så at Java hadde et final-keyword. Gleden var dog kortvarig da jeg fant ut hvor liten effekt final faktisk har når man jobber i en stor og gammel kodebase. C og C++ er kanskje kjent for segfaults, minnelekasjer og udefinert oppførsel, men noe har de gjort rett. I denne talken introduserer jeg C++ sitt keyword const, hvilket problem dette løser og hvorfor Java burde ha noe tilsvarende."
        },
        "hololens": {
          "pending": false,
          "speakers": [
            {
              "name": "Christian Egeberg",
              "bio": "Christian er en .Net utvikler med fokus på skyarkitektur og mobil. Han har dyp interesse for alle slags dingser og teknologi, liker å gjøre ting grundig, og tenker ofte utenfor bokser. Christian kan til tider sette umåtelig pris på bevisst å befinne seg på feil jorde.",
              "pic": "ceg.jpeg",
              "email": "ceg@knowit.no"
            }
          ],
          "title": "Hvordan programmere Microsoft HoloLens",
          "type": "Lyntale (20 min)",
          "description": "Hvorfor er HoloLens forskjellig fra andre Virtual Reality briller, og hvordan programmerer man for den. API støtte for world coordinates, gestures, gaze, voice, spatial sound og spatial mapping. Ja, jeg tar med en HoloLens."
        },
        "max": {
          "pending": false,
          "speakers": [
            {
              "name": "Andreas Bade",
              "bio": "Andreas har jobbet så lenge i Knowit at han har e-postadresse på to bokstaver. Han har programmert profesjonelt over i ti år, i hovedsak i Java, men også i .net. Han jobber nå som prosjektleder og teamleder, men er fortsatt glad i fikle med ting som er morsomme å fikle med.",
              "pic": "ab.png",
              "email": "ab@knowit.no"
            }
          ],
          "title": "Hippieprogrammering i Max",
          "type": "Lyntale (20 min)",
          "description": "Max er et programmeringsspråk som lar deg kombinere media og hardware på kreative måter. Språket ble laget på midten av åttitallet, men er fortsatt poplært. Det er et visuelt programmeringsspråk. Til tross for dette, er språket givende å programmere i og har et godt utviklingsmiljø.<br/><br/>Språket finnes i en open source variant som heter Pure Data.<br/><br/>Dette foredraget vil gi en kort innføring i språket og demoer for å vise mulighetene. Hensikten er å gi en overordnet forståelse av språket og mulige anvendelsesområder.<br/><br/>Foredraget egner seg både for de som kan programmere og ikke-programmere. Språket er veldig annerledes andres språk, så en begrenset “teknisk balast” kan tilogmed være en fordel."
        },
        "fuse": {
          "pending": false,
          "speakers": [
            {
              "name": "Håkon Gulbrandsen & Joakim Lehn",
              "bio": "Håkon og Joakim er backend utviklere som holder til på Oslo Kommune PFF prosjektet. De har særdeles lite app-utviklings erfaring å skryte av, og kan heller ikke noen ting om frontend, JavaScript eller noe annet som brukes i Fuse. Begge to har utdannelsen sin fra NTNU, og har ca et års fartstid som (betalte) utviklere.",
              "pic": "hakon.gulbrandsen.png",
              "email": "hakon.gulbrandsen@knowit.no,joakim.lehn@knowit.no"
            },
            {
              "name": "",
              "bio": "",
              "pic": "joakim.lehn.jpg",
              "email": ""
            }
          ],
          "title": "Fuse - Real deal?",
          "type": "Lyntale (10 min)",
          "description": "Hva skjer om du tar et par backend-utviklere og gir dem frie tøyler med et ferskt kryss-plattform mobilutviklingsrammeverk?<br/>Siden påske har vi brukt fagtimene til å finne ut svaret på akkurat det, ved å prøve å lage en app i Fuse!<br/>Vi ser kjapt på om Fuse er egnet og modent nok til kommersielt bruk, og viser fram tidenes app!"
        },
        "c4": {
          "pending": false,
          "speakers": [
            {
              "name": "Rune Myrdal",
              "bio": "Rune har jobbet i 18 år som systemutvikler, de siste 13 årene i Knowit Objectnet. Han jobber like gjerne som utvikler som teknisk eller funksjonell arkitekt. De siste årene har Rune jobbet hos SVV, Politiet, Telenor, TAD (ELSÆR), Skatteetaten, Oslo kommune (PET) og er nå tilbake hos Skatteetaten og skal være med å modernisere Folkeregisteret.",
              "pic": "rmy.jpg",
              "email": "rmy@knowit.no"
            }
          ],
          "title": "Lei av rotete arkitekturtegninger? Ta en titt på C4 modellen.",
          "type": "Lyntale (10 min)",
          "description": "På Knowit sin arkitektskole 2015/2016 presenterte Simon Brown C4 modellen. Flere enn de som gikk på og skal gå på Knowit sin arkitektskole kan ha nytte av å kjenne til C4 modellen og hvordan beskrive software arkitektur på en oversiktlig måte. Foredraget vil ta for seg C4 modellen som ble presentert på Knowit sin arkitektskole beskrevet i bøkene til Simon Brown: \"Software Architecture for Developers\" og \"The Art of Visualising Software Architecture (Communicating software architecture with sketches, diagrams and the C4 model)\"."
        },
        "presentasjonsteknikk": {
          "pending": false,
          "speakers": [
            {
              "name": "Michael Johansen",
              "bio": "IT-konsulent på dagen, startup founder om natten. På NTNU studerte Michael entreprenørskap, informatikk og psykologi. Under studiene tok han et år fri for å sitte i NTNUs styre. I startup-verden har han fått førstehåndserfaring med startup-scenen i både Boston og Silicon Valley. Mennesker og maskiner er de to tingene som interesserer ham mest. Forøvrig er han temmelig systematisk. Michael bryr seg mer enn de fleste om presentasjonsteknikk, og det er et tema han gjerne vil dele sine tanker om på fagseminaret i Fredrikstad.",
              "pic": "Michael.png",
              "email": "michael.johansen@knowit.no"
            }
          ],
          "title": "Presentasjonsteknikk",
          "type": "Foredrag (60 min)",
          "description": "Nesten alle PowerPoint-presentasjoner er elendige. Tilskuere klager stille på kvaliteten, men gir sjelden reell feedback til foredragsholdere. Og foredragsholderne selv får minimalt med opplæring om hverken menneskelige eller tekniske aspekter ved å holde en presentasjon. For å strø salt i såret er det ingen av de som holder foredrag om presentasjonsteknikk som er gode på det tekniske, så de prater kun om det menneskelige. I dette foredraget dekker vi alt. Vi tar vi en praktisk tilnærming, der alt du lærer her kan brukes direkte i ditt foredrag. Ta med laptopen og åpne notepad."
        }
    }
}
